USE `avatar`;

-- 电信相关套餐
INSERT INTO `operator`(`id`, `name`) VALUES
(1, '电信');

INSERT INTO `biz` (`id`, `name`, `operator`, `remark`, `cost`, `i1`, `i2`, `i3`, `i4`, `i5`) VALUES
(11, '50M', 1, NULL, 99, '全国流量不限量', '全国通话300分钟', '50M独享光纤宽带', '4K超清机顶盒、光猫', '2个号码共享套餐'),
(12, '100M', 1, '原价199元折后 119元/月', 119, '全国流量不限量', '全国通话1600分钟', '100M独享光纤宽带', '4K超清机顶盒、光猫', '3个号码共享套餐'),
(13, '200M', 1, '原价199元折后 140元/月', 140, '全国流量不限量', '全国通话1600分钟', '200M独享光纤宽带', '4K超清机顶盒、光猫', '3个号码共享套餐'),
(14, '商业光纤专线', 1, '原价999元折后 800元/月', 800, '全国流量不限量', '全国通话5000分钟', '300M独享光纤宽带', '超大IP上限(50台)终端', '6个号码共享套餐');

-- 移动相关套餐
INSERT INTO `operator`(`id`, `name`) VALUES
(2, '移动');

INSERT INTO `biz` (`id`, `name`, `operator`, `remark`, `cost`, `i1`, `i2`, `i3`, `i4`, `i5`) VALUES
(21, '100M', 2, NULL, 98, '全国流量不限量', '全国通话100分钟', '100M独享光纤宽带', '光猫', '1个号码共享套餐'),
(22, '200M', 2, NULL, 139, '全国流量不限量', '全国通话150分钟', '200M独享光纤宽带', '光猫', '3个号码共享套餐');


-- 联通相关套餐
INSERT INTO `operator`(`id`, `name`) VALUES
(3, '联通');

INSERT INTO `biz` (`id`, `name`, `operator`, `remark`, `cost`, `i1`, `i2`, `i3`, `i4`, `i5`) VALUES
(31, '100M', 3, NULL, 98, '全国流量不限量', '全国通话1000分钟', '100M独享光纤宽带', '光猫', '2个号码共享套餐'),
(32, '200M', 3, NULL, 198, '全国流量不限量', '全国通话3000分钟', '200M独享光纤宽带', '光猫', '4个号码共享套餐');